const locale = {
  common: {
    greeting: 'Стартовое сообщение',
    notification: 'Уведомление от сервера',
    update_message: 'Сообщение обновления',
    main_menu: 'Сообщение главного меню',
    sceneOne: 'Сцена №1',
    sceneTwo: 'Сцена №2',
  },
  buttons: {
    balance: '💵 Баланс',
    referral: '💎 Партнерка',
    feedback: '📲 Обратная связь',
    invite: '🤝 Пригласить друга',
    input_money: '💸 Пополнить',
    all_payments: '🧾 Все пополнения',
    qiwi: '🟠 QIWI',
    yoomoney: '🟣 ЮMoney',
    check_payment: '♻️ Проверить платеж',
    back: '🔙 Назад',
    confirm: '✔️ Применить',
    great: '✅ Отлично!',
    add_wallet: '🟩 Добавить',
    deactivate_wallet: '🟥 Деактивировать',
  },
  admin_menu: {
    message: 'Что хочешь сделать?',
    error: 'Это меню только для администрации. Извините, но ты не админ!',
  },
  referral: {
    title: '🙋‍♂️ Партнерская программа',
    message: '🎁 Приглашай друзей и получай 10% от каждого пополнения баланса другом.',
    balance: '💰 Твой партнерский баланс: ',
    notification: {
      registration_success: 'По твоей ссылке зарегистрировался ',
      bonus: 'Теперь ты будешь получать 10% с каждого его пополнения баланса',

      // money_part1: 'Тебе начисленно ',
      // money_part2: ' за пополнение рефералом ',
    },
  },
  invite: {
    title: 'Просто перешли другу следующее сообщение⤵️',
    message: 'Йо, здарова!\nСообщение с реферральной ссылочкой:',
    // bonus: 'При переходе по ссылке получишь +10% на первое пополнение баланса.',
  },
};

export default locale;
